# Color Class

---
Represents a color in Autodesk Revit.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBColor
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class Color : APIObject

    Public Class Color
    	Inherits APIObject

    public ref class Color : public APIObject

    type Color =
        class
            inherit APIObject
        end
The Color type exposes the following members.
| Name| Description
---|---|---
| Color| Constructor that takes the red, green and blue channels of the color.
Top
| Name| Description
---|---|---
| Blue| Get the blue channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
| Green| Get the green channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
| InvalidColorValue|  Get the invalid Color whose IntegerValue is -1.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| IsValid| Identifies if the color represents a valid color, or an uninitialized/invalid value.
| Red| Get the red channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
Top
| Name| Description
---|---|---
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
Colors obtained from some API methods may represent an uninitialized/invalid color. You can identify these using the IsValid property.
#### Reference
Autodesk.Revit.DB Namespace